hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
        <register>
          <name>TPQ</name>
          <description>Transmit Pause Quantum Register</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPQ</name>
              <description>Transmit Pause Quantum</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TPSF</name>
          <description>TX Partial Store and Forward Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPB1ADR</name>
              <description>Transmit Partial Store and Forward Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>ENTXP</name>
              <description>Enable TX Partial Store and Forward Operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSF</name>
          <description>RX Partial Store and Forward Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RPB1ADR</name>
              <description>Receive Partial Store and Forward Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>ENRXP</name>
              <description>Enable RX Partial Store and Forward Operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RJFML</name>
          <description>RX Jumbo Frame Max Length Register</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FML</name>
              <description>Frame Max Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HRB</name>
          <description>Hash Register Bottom</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hash Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HRT</name>
          <description>Hash Register Top</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hash Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>8</dimIncrement>
          <dimIndex>1-4</dimIndex>
          <name>GMAC_SA%s</name>
          <description>Specific Address 1 Bottom Register</description>
          <addressOffset>0x088</addressOffset>
          <register>
            <name>SAB</name>
            <description>Specific Address 1 Bottom Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Specific Address 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SAT</name>
            <description>Specific Address 1 Top Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Specific Address 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TIDM1</name>
          <description>Type ID Match 1 Register</description>
          <addressOffset>0x0A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TID</name>
              <description>Type ID Match 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ENID1</name>
              <description>Enable Copying of TID Matched Frames</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIDM2</name>
          <description>Type ID Match 2 Register</description>
          <addressOffset>0x0AC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TID</name>
              <description>Type ID Match 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ENID2</name>
              <description>Enable Copying of TID Matched Frames</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIDM3</name>
          <description>Type ID Match 3 Register</description>
          <addressOffset>0x0B0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TID</name>
              <description>Type ID Match 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ENID3</name>
              <description>Enable Copying of TID Matched Frames</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIDM4</name>
          <description>Type ID Match 4 Register</description>
          <addressOffset>0x0B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TID</name>
              <description>Type ID Match 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ENID4</name>
              <description>Enable Copying of TID Matched Frames</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOL</name>
          <description>Wake on LAN Register</description>
          <addressOffset>0x0B8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IP</name>
              <description>ARP Request IP Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MAG</name>
              <description>Magic Packet Event Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARP</name>
              <description>ARP Request IP Address</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SA1</name>
              <description>Specific Address Register 1 Event Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTI</name>
              <description>Multicast Hash Event Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGS</name>
          <description>IPG Stretch Register</description>
          <addressOffset>0x0BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FL</name>
              <description>Frame Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SVLAN</name>
          <description>Stacked VLAN Register</description>
          <addressOffset>0x0C0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLAN_TYPE</name>
              <description>User Defined VLAN_TYPE Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ESVLAN</name>
              <description>Enable Stacked VLAN Processing Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TPFCP</name>
          <description>Transmit PFC Pause Register</description>
          <addressOffset>0x0C4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PEV</name>
              <description>Priority Enable Vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PQ</name>
              <description>Pause Quantum</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMB1</name>
          <description>Specific Address 1 Mask Bottom Register</description>
          <addressOffset>0x0C8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Specific Address 1 Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMT1</name>
          <description>Specific Address 1 Mask Top Register</description>
          <addressOffset>0x0CC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Specific Address 1 Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSC</name>
          <description>1588 Timer Nanosecond Comparison Register</description>
          <addressOffset>0x0DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NANOSEC</name>
              <description>1588 Timer Nanosecond Comparison Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL</name>
          <description>1588 Timer Second Comparison Low Register</description>
          <addressOffset>0x0E0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC</name>
              <description>1588 Timer Second Comparison Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCH</name>
          <description>1588 Timer Second Comparison High Register</description>
          <addressOffset>0x0E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC</name>
              <description>1588 Timer Second Comparison Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTSH</name>
          <description>PTP Event Frame Transmitted Seconds High Register</description>
          <addressOffset>0x0E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRSH</name>
          <description>PTP Event Frame Received Seconds High Register</description>
          <addressOffset>0x0EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTSH</name>
          <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
          <addressOffset>0x0F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRSH</name>
          <description>PTP Peer Event Frame Received Seconds High Register</description>
          <addressOffset>0x0F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTLO</name>
          <description>Octets Transmitted Low Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXO</name>
              <description>Transmitted Octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTHI</name>
          <description>Octets Transmitted High Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXO</name>
              <description>Transmitted Octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FT</name>
          <description>Frames Transmitted Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FTX</name>
              <description>Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFT</name>
          <description>Broadcast Frames Transmitted Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BFTX</name>
              <description>Broadcast Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MFT</name>
          <description>Multicast Frames Transmitted Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MFTX</name>
              <description>Multicast Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PFT</name>
          <description>Pause Frames Transmitted Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PFTX</name>
              <description>Pause Frames Transmitted Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BFT64</name>
          <description>64 Byte Frames Transmitted Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>64 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT127</name>
          <description>65 to 127 Byte Frames Transmitted Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>65 to 127 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT255</name>
          <description>128 to 255 Byte Frames Transmitted Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>128 to 255 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT511</name>
          <description>256 to 511 Byte Frames Transmitted Register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>256 to 511 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT1023</name>
          <description>512 to 1023 Byte Frames Transmitted Register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>512 to 1023 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT1518</name>
          <description>1024 to 1518 Byte Frames Transmitted Register</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>1024 to 1518 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GTBFT1518</name>
          <description>Greater Than 1518 Byte Frames Transmitted Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>Greater than 1518 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TUR</name>
          <description>Transmit Underruns Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXUNR</name>
              <description>Transmit Underruns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCF</name>
          <description>Single Collision Frames Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SCOL</name>
              <description>Single Collision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCF</name>
          <description>Multiple Collision Frames Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MCOL</name>
              <description>Multiple Collision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EC</name>
          <description>Excessive Collisions Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>XCOL</name>
              <description>Excessive Collisions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
