hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>TBQBAPQ[%s]</name>
          <description>Transmit Buffer Queue Base Address Register Priority Queue index = 1 0</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXBQBA</name>
              <description>Transmit Buffer Queue Base Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>RBQBAPQ[%s]</name>
          <description>Receive Buffer Queue Base Address Register Priority Queue index = 1 0</description>
          <addressOffset>0x47C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXBQBA</name>
              <description>Receive Buffer Queue Base Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>RBSRPQ[%s]</name>
          <description>Receive Buffer Size Register Priority Queue index = 1 0</description>
          <addressOffset>0x49C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RBS</name>
              <description>Receive Buffer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBSCR</name>
          <description>Credit-Based Shaping Control Register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QBE</name>
              <description>Queue B CBS Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QAE</name>
              <description>Queue A CBS Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBSISQA</name>
          <description>Credit-Based Shaping IdleSlope Register for Queue A</description>
          <addressOffset>0x4C0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IS</name>
              <description>IdleSlope</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBSISQB</name>
          <description>Credit-Based Shaping IdleSlope Register for Queue B</description>
          <addressOffset>0x4C4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IS</name>
              <description>IdleSlope</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>ST1RPQ[%s]</name>
          <description>Screening Type 1 Register Priority Queue index = 0 0</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QNB</name>
              <description>Queue Number 0-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DSTCM</name>
              <description>Differentiated Services or Traffic Class Match</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>UDPM</name>
              <description>UDP Port Match</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DSTCE</name>
              <description>Differentiated Services or Traffic Class Match Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDPE</name>
              <description>UDP Port Match Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>ST2RPQ[%s]</name>
          <description>Screening Type 2 Register Priority Queue index = 0 0</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QNB</name>
              <description>Queue Number 0-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>VLANP</name>
              <description>VLAN Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>VLANE</name>
              <description>VLAN Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2ETH</name>
              <description>Index of Screening Type 2 EtherType register x</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ETHE</name>
              <description>EtherType Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPA</name>
              <description>Index of Screening Type 2 Compare Word 0/Word 1 register x</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>COMPAE</name>
              <description>Compare A Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPB</name>
              <description>Index of Screening Type 2 Compare Word 0/Word 1 register x</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>COMPBE</name>
              <description>Compare B Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPC</name>
              <description>Index of Screening Type 2 Compare Word 0/Word 1 register x</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>COMPCE</name>
              <description>Compare C Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>IERPQ[%s]</name>
          <description>Interrupt Enable Register Priority Queue index = 1 0</description>
          <addressOffset>0x5FC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RCOMP</name>
              <description>Receive Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXUBR</name>
              <description>RX Used Bit Read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLEX</name>
              <description>Retry Limit Exceeded or Late Collision</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFC</name>
              <description>Transmit Frame Corruption Due to AHB Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCOMP</name>
              <description>Transmit Complete</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVR</name>
              <description>Receive Overrun</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRESP</name>
              <description>HRESP Not OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>IDRPQ[%s]</name>
          <description>Interrupt Disable Register Priority Queue index = 1 0</description>
          <addressOffset>0x61C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RCOMP</name>
              <description>Receive Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXUBR</name>
              <description>RX Used Bit Read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLEX</name>
              <description>Retry Limit Exceeded or Late Collision</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFC</name>
              <description>Transmit Frame Corruption Due to AHB Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCOMP</name>
              <description>Transmit Complete</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVR</name>
              <description>Receive Overrun</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRESP</name>
              <description>HRESP Not OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>IMRPQ[%s]</name>
          <description>Interrupt Mask Register Priority Queue index = 1 0</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RCOMP</name>
              <description>Receive Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXUBR</name>
              <description>RX Used Bit Read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLEX</name>
              <description>Retry Limit Exceeded or Late Collision</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB</name>
              <description>AHB Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCOMP</name>
              <description>Transmit Complete</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVR</name>
              <description>Receive Overrun</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRESP</name>
              <description>HRESP Not OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>ST2ER[%s]</name>
          <description>Screening Type 2 Ethertype Register index = 0 0</description>
          <addressOffset>0x6E0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPVAL</name>
              <description>Ethertype Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW00</name>
          <description>Screening Type 2 Compare Word 0 Register index = 0</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASKVAL</name>
              <description>Mask Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>COMPVAL</name>
              <description>Compare Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW10</name>
          <description>Screening Type 2 Compare Word 1 Register index = 0</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSVAL</name>
              <description>Offset Value in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OFFSSTRT</name>
              <description>Ethernet Frame Offset Start</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OFFSSTRTSelect</name>
                <enumeratedValue>
                  <name>FRAMESTART</name>
                  <description>Offset from the start of the frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETHERTYPE</name>
                  <description>Offset from the byte after the EtherType field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IP</name>
                  <description>Offset from the byte after the IP header field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCP_UDP</name>
                  <description>Offset from the byte after the TCP/UDP header field</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW01</name>
          <description>Screening Type 2 Compare Word 0 Register index = 1</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASKVAL</name>
              <description>Mask Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>COMPVAL</name>
              <description>Compare Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW11</name>
          <description>Screening Type 2 Compare Word 1 Register index = 1</description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSVAL</name>
              <description>Offset Value in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OFFSSTRT</name>
              <description>Ethernet Frame Offset Start</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OFFSSTRTSelect</name>
                <enumeratedValue>
                  <name>FRAMESTART</name>
                  <description>Offset from the start of the frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETHERTYPE</name>
                  <description>Offset from the byte after the EtherType field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IP</name>
                  <description>Offset from the byte after the IP header field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCP_UDP</name>
                  <description>Offset from the byte after the TCP/UDP header field</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW02</name>
          <description>Screening Type 2 Compare Word 0 Register index = 2</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASKVAL</name>
              <description>Mask Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>COMPVAL</name>
              <description>Compare Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW12</name>
          <description>Screening Type 2 Compare Word 1 Register index = 2</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSVAL</name>
              <description>Offset Value in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OFFSSTRT</name>
              <description>Ethernet Frame Offset Start</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OFFSSTRTSelect</name>
                <enumeratedValue>
                  <name>FRAMESTART</name>
                  <description>Offset from the start of the frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETHERTYPE</name>
                  <description>Offset from the byte after the EtherType field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IP</name>
                  <description>Offset from the byte after the IP header field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCP_UDP</name>
                  <description>Offset from the byte after the TCP/UDP header field</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW03</name>
          <description>Screening Type 2 Compare Word 0 Register index = 3</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASKVAL</name>
              <description>Mask Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>COMPVAL</name>
              <description>Compare Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CW13</name>
          <description>Screening Type 2 Compare Word 1 Register index = 3</description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSVAL</name>
              <description>Offset Value in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OFFSSTRT</name>
              <description>Ethernet Frame Offset Start</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OFFSSTRTSelect</name>
                <enumeratedValue>
                  <name>FRAMESTART</name>
                  <description>Offset from the start of the frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETHERTYPE</name>
                  <description>Offset from the byte after the EtherType field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IP</name>
                  <description>Offset from the byte after the IP header field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCP_UDP</name>
                  <description>Offset from the byte after the TCP/UDP header field</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
