hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ISI</name>
      <version>6350I</version>
      <description>Image Sensor Interface</description>
      <groupName>ISI</groupName>
      <prependToName>ISI_</prependToName>
      <baseAddress>0x4004C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xEC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ISI</name>
        <value>59</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG1</name>
          <description>ISI Configuration 1 Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HSYNC_POL</name>
              <description>Horizontal Synchronization Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC_POL</name>
              <description>Vertical Synchronization Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PIXCLK_POL</name>
              <description>Pixel Clock Polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GRAYLE</name>
              <description>Grayscale Little Endian</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMB_SYNC</name>
              <description>Embedded Synchronization</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_SYNC</name>
              <description>Embedded Synchronization Correction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRATE</name>
              <description>Frame Rate [0..7]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DISCR</name>
              <description>Disable Codec Request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FULL</name>
              <description>Full Mode is Allowed</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THMASK</name>
              <description>Threshold Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>THMASKSelect</name>
                <enumeratedValue>
                  <name>BEATS_4</name>
                  <description>Only 4 beats AHB burst allowed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS_8</name>
                  <description>Only 4 and 8 beats AHB burst allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS_16</name>
                  <description>4, 8 and 16 beats AHB burst allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLD</name>
              <description>Start of Line Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SFD</name>
              <description>Start of Frame Delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>ISI Configuration 2 Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IM_VSIZE</name>
              <description>Vertical Size of the Image Sensor [0..2047]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GS_MODE</name>
              <description>Grayscale Pixel Format Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RGB_MODE</name>
              <description>RGB Input Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GRAYSCALE</name>
              <description>Grayscale Mode Format Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RGB_SWAP</name>
              <description>RGB Format Swap Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COL_SPACE</name>
              <description>Color Space for the Image Data</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IM_HSIZE</name>
              <description>Horizontal Size of the Image Sensor [0..2047]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>YCC_SWAP</name>
              <description>YCrCb Format Swap Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>YCC_SWAPSelect</name>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Byte 0 CbiByte 1 YiByte 2 CriByte 3 Yi+1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Byte 0 CriByte 1 YiByte 2 CbiByte 3 Yi+1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Byte 0 YiByte 1 CbiByte 2 Yi+1Byte 3 Cri</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Byte 0 YiByte 1 CriByte 2 Yi+1Byte 3 Cbi</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RGB_CFG</name>
              <description>RGB Pixel Mapping Configuration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RGB_CFGSelect</name>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Byte 0 R/GMSBByte 1 GLSB/BByte 2 R/GMSBByte 3 GLSB/B</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Byte 0 B/GMSBByte 1 GLSB/RByte 2 B/GMSBByte 3 GLSB/R</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Byte 0 GLSB/RByte 1 B/GMSBByte 2 GLSB/RByte 3 B/GMSB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Byte 0 GLSB/BByte 1 R/GMSBByte 2 GLSB/BByte 3 R/GMSB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSIZE</name>
          <description>ISI Preview Size Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREV_VSIZE</name>
              <description>Vertical Size for the Preview Path</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PREV_HSIZE</name>
              <description>Horizontal Size for the Preview Path</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDECF</name>
          <description>ISI Preview Decimation Factor Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEC_FACTOR</name>
              <description>Decimation Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>Y2R_SET0</name>
          <description>ISI Color Space Conversion YCrCb To RGB Set 0 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>C0</name>
              <description>Color Space Conversion Matrix Coefficient C0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Color Space Conversion Matrix Coefficient C1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>C2</name>
              <description>Color Space Conversion Matrix Coefficient C2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Color Space Conversion Matrix Coefficient C3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>Y2R_SET1</name>
          <description>ISI Color Space Conversion YCrCb To RGB Set 1 Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>C4</name>
              <description>Color Space Conversion Matrix Coefficient C4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>Yoff</name>
              <description>Color Space Conversion Luminance Default Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Croff</name>
              <description>Color Space Conversion Red Chrominance Default Offset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Cboff</name>
              <description>Color Space Conversion Blue Chrominance Default Offset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R2Y_SET0</name>
          <description>ISI Color Space Conversion RGB To YCrCb Set 0 Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>C0</name>
              <description>Color Space Conversion Matrix Coefficient C0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Color Space Conversion Matrix Coefficient C1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>C2</name>
              <description>Color Space Conversion Matrix Coefficient C2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>Roff</name>
              <description>Color Space Conversion Red Component Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R2Y_SET1</name>
          <description>ISI Color Space Conversion RGB To YCrCb Set 1 Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>C3</name>
              <description>Color Space Conversion Matrix Coefficient C3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Color Space Conversion Matrix Coefficient C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>C5</name>
              <description>Color Space Conversion Matrix Coefficient C5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>Goff</name>
              <description>Color Space Conversion Green Component Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R2Y_SET2</name>
          <description>ISI Color Space Conversion RGB To YCrCb Set 2 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>C6</name>
              <description>Color Space Conversion Matrix Coefficient C6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>C7</name>
              <description>Color Space Conversion Matrix Coefficient C7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>C8</name>
              <description>Color Space Conversion Matrix Coefficient C8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>Boff</name>
              <description>Color Space Conversion Blue Component Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>ISI Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ISI_EN</name>
              <description>ISI Module Enable Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISI_DIS</name>
              <description>ISI Module Disable Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISI_SRST</name>
              <description>ISI Software Reset Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISI_CDC</name>
              <description>ISI Codec Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>ISI Status Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Module Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_DONE</name>
              <description>Module Disable Request has Terminated cleared on read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRST</name>
              <description>Module Software Reset Request has Terminated cleared on read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDC_PND</name>
              <description>Pending Codec Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC</name>
              <description>Vertical Synchronization cleared on read</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PXFR_DONE</name>
              <description>Preview DMA Transfer has Terminated cleared on read</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CXFR_DONE</name>
              <description>Codec DMA Transfer has Terminated cleared on read</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIP</name>
              <description>Synchronization in Progress</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P_OVR</name>
              <description>Preview Datapath Overflow cleared on read</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C_OVR</name>
              <description>Codec Datapath Overflow cleared on read</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>CRC Synchronization Error cleared on read</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FR_OVR</name>
              <description>Frame Rate Overrun cleared on read</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>ISI Interrupt Enable Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DIS_DONE</name>
              <description>Disable Done Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRST</name>
              <description>Software Reset Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC</name>
              <description>Vertical Synchronization Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PXFR_DONE</name>
              <description>Preview DMA Transfer Done Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CXFR_DONE</name>
              <description>Codec DMA Transfer Done Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P_OVR</name>
              <description>Preview Datapath Overflow Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C_OVR</name>
              <description>Codec Datapath Overflow Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>Embedded Synchronization CRC Error Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FR_OVR</name>
              <description>Frame Rate Overflow Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
