hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
        <register>
          <name>PCSR0</name>
          <description>Peripheral Clock Status Register 0</description>
          <addressOffset>0x0018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID7</name>
              <description>Peripheral Clock 7 Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID8</name>
              <description>Peripheral Clock 8 Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID9</name>
              <description>Peripheral Clock 9 Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID10</name>
              <description>Peripheral Clock 10 Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID11</name>
              <description>Peripheral Clock 11 Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID12</name>
              <description>Peripheral Clock 12 Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID13</name>
              <description>Peripheral Clock 13 Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID14</name>
              <description>Peripheral Clock 14 Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID15</name>
              <description>Peripheral Clock 15 Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID16</name>
              <description>Peripheral Clock 16 Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID17</name>
              <description>Peripheral Clock 17 Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID18</name>
              <description>Peripheral Clock 18 Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID19</name>
              <description>Peripheral Clock 19 Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral Clock 20 Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral Clock 21 Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral Clock 22 Status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral Clock 23 Status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral Clock 24 Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral Clock 25 Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral Clock 26 Status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral Clock 27 Status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral Clock 28 Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral Clock 29 Status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral Clock 30 Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID31</name>
              <description>Peripheral Clock 31 Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_UCKR</name>
          <description>UTMI Clock Register</description>
          <addressOffset>0x001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPLLEN</name>
              <description>UTMI PLL Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPLLCOUNT</name>
              <description>UTMI PLL Start-up Time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_MOR</name>
          <description>Main Oscillator Register</description>
          <addressOffset>0x0020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MOSCXTEN</name>
              <description>Main Crystal Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCXTBY</name>
              <description>Main Crystal Oscillator Bypass</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITMODE</name>
              <description>Wait Mode Command Write-only</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCRCEN</name>
              <description>Main RC Oscillator Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCRCF</name>
              <description>Main RC Oscillator Frequency Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>MOSCRCFSelect</name>
                <enumeratedValue>
                  <name>_4_MHz</name>
                  <description>The RC oscillator frequency is at 4 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_MHz</name>
                  <description>The RC oscillator frequency is at 8 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_MHz</name>
                  <description>The RC oscillator frequency is at 12 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOSCXTST</name>
              <description>Main Crystal Oscillator Startup Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Write Access Password</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                  <value>0x37</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOSCSEL</name>
              <description>Main Clock Oscillator Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFDEN</name>
              <description>Clock Failure Detector Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XT32KFME</name>
              <description>32.768 kHz Crystal Oscillator Frequency Monitoring Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_MCFR</name>
          <description>Main Clock Frequency Register</description>
          <addressOffset>0x0024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAINF</name>
              <description>Main Clock Frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MAINFRDY</name>
              <description>Main Clock Frequency Measure Ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCMEAS</name>
              <description>RC Oscillator Frequency Measure write-only</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCSS</name>
              <description>Counter Clock Source Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_PLLAR</name>
          <description>PLLA Register</description>
          <addressOffset>0x0028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIVA</name>
              <description>PLLA Front End Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DIVASelect</name>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Divider output is 0 and PLLA is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Divider is bypassed divide by 1 and PLLA is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLACOUNT</name>
              <description>PLLA Counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MULA</name>
              <description>PLLA Multiplier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>ONE</name>
              <description>Must Be Set to 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCKR</name>
          <description>Master Clock Register</description>
          <addressOffset>0x0030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CSS</name>
              <description>Master Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CSSSelect</name>
                <enumeratedValue>
                  <name>SLOW_CLK</name>
                  <description>Slow Clock is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>Main Clock is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLA_CLK</name>
                  <description>PLLA Clock is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPLL_CLK</name>
                  <description>Divided UPLL Clock is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRES</name>
              <description>Processor Clock Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PRESSelect</name>
                <enumeratedValue>
                  <name>CLK_1</name>
                  <description>Selected clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_2</name>
                  <description>Selected clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_4</name>
                  <description>Selected clock divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_8</name>
                  <description>Selected clock divided by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_16</name>
                  <description>Selected clock divided by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_32</name>
                  <description>Selected clock divided by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_64</name>
                  <description>Selected clock divided by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_3</name>
                  <description>Selected clock divided by 3</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIV</name>
              <description>Master Clock Division</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MDIVSelect</name>
                <enumeratedValue>
                  <name>EQ_PCK</name>
                  <description>Master Clock is Prescaler Output Clock divided by 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCK_DIV2</name>
                  <description>Master Clock is Prescaler Output Clock divided by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCK_DIV4</name>
                  <description>Master Clock is Prescaler Output Clock divided by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCK_DIV3</name>
                  <description>Master Clock is Prescaler Output Clock divided by 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPLLDIV2</name>
              <description>UPLL Divider by 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB</name>
          <description>USB Clock Register</description>
          <addressOffset>0x0038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USBS</name>
              <description>USB Input Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBDIV</name>
              <description>Divider for USB_48M</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>PCK[%s]</name>
          <description>Programmable Clock Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CSS</name>
              <description>Programmable Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CSSSelect</name>
                <enumeratedValue>
                  <name>SLOW_CLK</name>
                  <description>SLCK is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>MAINCK is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLA_CLK</name>
                  <description>PLLACK is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPLL_CLK</name>
                  <description>UPLLCKDIV is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>MCK is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRES</name>
              <description>Programmable Clock Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
