hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
        <register>
          <name>FSPR</name>
          <description>Fast Startup Polarity Register</description>
          <addressOffset>0x0074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FSTP0</name>
              <description>Fast Startup Input Polarity 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP1</name>
              <description>Fast Startup Input Polarity 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP2</name>
              <description>Fast Startup Input Polarity 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP3</name>
              <description>Fast Startup Input Polarity 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP4</name>
              <description>Fast Startup Input Polarity 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP5</name>
              <description>Fast Startup Input Polarity 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP6</name>
              <description>Fast Startup Input Polarity 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP7</name>
              <description>Fast Startup Input Polarity 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP8</name>
              <description>Fast Startup Input Polarity 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP9</name>
              <description>Fast Startup Input Polarity 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP10</name>
              <description>Fast Startup Input Polarity 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP11</name>
              <description>Fast Startup Input Polarity 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP12</name>
              <description>Fast Startup Input Polarity 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP13</name>
              <description>Fast Startup Input Polarity 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP14</name>
              <description>Fast Startup Input Polarity 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSTP15</name>
              <description>Fast Startup Input Polarity 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FOCR</name>
          <description>Fault Output Clear Register</description>
          <addressOffset>0x0078</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FOCLR</name>
              <description>Fault Output Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0x00E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>WPKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                  <value>0x504D43</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0x00E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCER1</name>
          <description>Peripheral Clock Enable Register 1</description>
          <addressOffset>0x0100</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID32</name>
              <description>Peripheral Clock 32 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID33</name>
              <description>Peripheral Clock 33 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral Clock 34 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID35</name>
              <description>Peripheral Clock 35 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID37</name>
              <description>Peripheral Clock 37 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID39</name>
              <description>Peripheral Clock 39 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral Clock 40 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID41</name>
              <description>Peripheral Clock 41 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID42</name>
              <description>Peripheral Clock 42 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID43</name>
              <description>Peripheral Clock 43 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID44</name>
              <description>Peripheral Clock 44 Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID45</name>
              <description>Peripheral Clock 45 Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID46</name>
              <description>Peripheral Clock 46 Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID47</name>
              <description>Peripheral Clock 47 Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID48</name>
              <description>Peripheral Clock 48 Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID49</name>
              <description>Peripheral Clock 49 Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID50</name>
              <description>Peripheral Clock 50 Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID51</name>
              <description>Peripheral Clock 51 Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID52</name>
              <description>Peripheral Clock 52 Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID53</name>
              <description>Peripheral Clock 53 Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID56</name>
              <description>Peripheral Clock 56 Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID57</name>
              <description>Peripheral Clock 57 Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID58</name>
              <description>Peripheral Clock 58 Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID59</name>
              <description>Peripheral Clock 59 Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID60</name>
              <description>Peripheral Clock 60 Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR1</name>
          <description>Peripheral Clock Disable Register 1</description>
          <addressOffset>0x0104</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID32</name>
              <description>Peripheral Clock 32 Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID33</name>
              <description>Peripheral Clock 33 Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral Clock 34 Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID35</name>
              <description>Peripheral Clock 35 Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID37</name>
              <description>Peripheral Clock 37 Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID39</name>
              <description>Peripheral Clock 39 Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral Clock 40 Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID41</name>
              <description>Peripheral Clock 41 Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID42</name>
              <description>Peripheral Clock 42 Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID43</name>
              <description>Peripheral Clock 43 Disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID44</name>
              <description>Peripheral Clock 44 Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID45</name>
              <description>Peripheral Clock 45 Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID46</name>
              <description>Peripheral Clock 46 Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID47</name>
              <description>Peripheral Clock 47 Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID48</name>
              <description>Peripheral Clock 48 Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID49</name>
              <description>Peripheral Clock 49 Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID50</name>
              <description>Peripheral Clock 50 Disable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID51</name>
              <description>Peripheral Clock 51 Disable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID52</name>
              <description>Peripheral Clock 52 Disable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID53</name>
              <description>Peripheral Clock 53 Disable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID56</name>
              <description>Peripheral Clock 56 Disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID57</name>
              <description>Peripheral Clock 57 Disable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID58</name>
              <description>Peripheral Clock 58 Disable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID59</name>
              <description>Peripheral Clock 59 Disable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID60</name>
              <description>Peripheral Clock 60 Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSR1</name>
          <description>Peripheral Clock Status Register 1</description>
          <addressOffset>0x0108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID32</name>
              <description>Peripheral Clock 32 Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID33</name>
              <description>Peripheral Clock 33 Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral Clock 34 Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID35</name>
              <description>Peripheral Clock 35 Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID37</name>
              <description>Peripheral Clock 37 Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID39</name>
              <description>Peripheral Clock 39 Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral Clock 40 Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID41</name>
              <description>Peripheral Clock 41 Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID42</name>
              <description>Peripheral Clock 42 Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID43</name>
              <description>Peripheral Clock 43 Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID44</name>
              <description>Peripheral Clock 44 Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID45</name>
              <description>Peripheral Clock 45 Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID46</name>
              <description>Peripheral Clock 46 Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID47</name>
              <description>Peripheral Clock 47 Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID48</name>
              <description>Peripheral Clock 48 Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID49</name>
              <description>Peripheral Clock 49 Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID50</name>
              <description>Peripheral Clock 50 Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID51</name>
              <description>Peripheral Clock 51 Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID52</name>
              <description>Peripheral Clock 52 Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID53</name>
              <description>Peripheral Clock 53 Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID56</name>
              <description>Peripheral Clock 56 Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID57</name>
              <description>Peripheral Clock 57 Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID58</name>
              <description>Peripheral Clock 58 Status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID59</name>
              <description>Peripheral Clock 59 Status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID60</name>
              <description>Peripheral Clock 60 Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
