hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <version>6343U</version>
      <description>Pulse Width Modulation Controller</description>
      <groupName>PWM</groupName>
      <prependToName>PWM_</prependToName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x464</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWM0</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CLK</name>
          <description>PWM Clock Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIVA</name>
              <description>CLKA Divide Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DIVASelect</name>
                <enumeratedValue>
                  <name>CLKA_POFF</name>
                  <description>CLKA clock is turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREA</name>
                  <description>CLKA clock is clock selected by PREA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREA</name>
              <description>CLKA Source Clock Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PREASelect</name>
                <enumeratedValue>
                  <name>CLK</name>
                  <description>Peripheral clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV2</name>
                  <description>Peripheral clock/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV4</name>
                  <description>Peripheral clock/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV8</name>
                  <description>Peripheral clock/8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV16</name>
                  <description>Peripheral clock/16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV32</name>
                  <description>Peripheral clock/32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV64</name>
                  <description>Peripheral clock/64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV128</name>
                  <description>Peripheral clock/128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV256</name>
                  <description>Peripheral clock/256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV512</name>
                  <description>Peripheral clock/512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV1024</name>
                  <description>Peripheral clock/1024</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVB</name>
              <description>CLKB Divide Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DIVBSelect</name>
                <enumeratedValue>
                  <name>CLKB_POFF</name>
                  <description>CLKB clock is turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREB</name>
                  <description>CLKB clock is clock selected by PREB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREB</name>
              <description>CLKB Source Clock Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PREBSelect</name>
                <enumeratedValue>
                  <name>CLK</name>
                  <description>Peripheral clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV2</name>
                  <description>Peripheral clock/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV4</name>
                  <description>Peripheral clock/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV8</name>
                  <description>Peripheral clock/8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV16</name>
                  <description>Peripheral clock/16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV32</name>
                  <description>Peripheral clock/32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV64</name>
                  <description>Peripheral clock/64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV128</name>
                  <description>Peripheral clock/128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV256</name>
                  <description>Peripheral clock/256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV512</name>
                  <description>Peripheral clock/512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV1024</name>
                  <description>Peripheral clock/1024</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENA</name>
          <description>PWM Enable Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Channel ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Channel ID</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Channel ID</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Channel ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS</name>
          <description>PWM Disable Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Channel ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Channel ID</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Channel ID</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Channel ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>PWM Status Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Channel ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Channel ID</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Channel ID</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Channel ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER1</name>
          <description>PWM Interrupt Enable Register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3 Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0 Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1 Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2 Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3 Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR1</name>
          <description>PWM Interrupt Disable Register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0 Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1 Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2 Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3 Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0 Interrupt Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1 Interrupt Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2 Interrupt Disable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3 Interrupt Disable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR1</name>
          <description>PWM Interrupt Mask Register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0 Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1 Interrupt Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2 Interrupt Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3 Interrupt Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0 Interrupt Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1 Interrupt Mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2 Interrupt Mask</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3 Interrupt Mask</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR1</name>
          <description>PWM Interrupt Status Register 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCM</name>
          <description>PWM Sync Channels Mode Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC0</name>
              <description>Synchronous Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC1</name>
              <description>Synchronous Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC2</name>
              <description>Synchronous Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC3</name>
              <description>Synchronous Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPDM</name>
              <description>Synchronous Channels Update Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>UPDMSelect</name>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Manual write of double buffer registers and manual update of synchronous channels</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Manual write of double buffer registers and automatic update of synchronous channels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Automatic write of duty-cycle update registers by the DMA Controller and automatic update of synchronous channels</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTRM</name>
              <description>DMA Controller Transfer Request Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTRCS</name>
              <description>DMA Controller Transfer Request Comparison Selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>PWM DMA Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMADUTY</name>
              <description>Duty-Cycle Holding Register for DMA Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCUC</name>
          <description>PWM Sync Channels Update Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPDULOCK</name>
              <description>Synchronous Channels Update Unlock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCUP</name>
          <description>PWM Sync Channels Update Period Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPR</name>
              <description>Update Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>UPRCNT</name>
              <description>Update Period Counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
