hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RSTC</name>
      <version>11009J</version>
      <description>Reset Controller</description>
      <groupName>RSTC</groupName>
      <prependToName>RSTC_</prependToName>
      <baseAddress>0x400E1800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RSTC</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PROCRST</name>
              <description>Processor Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTRST</name>
              <description>External Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>System Reset Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>URSTS</name>
              <description>User Reset Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTTYP</name>
              <description>Reset Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>RSTTYPSelect</name>
                <enumeratedValue>
                  <name>GENERAL_RST</name>
                  <description>First power-up reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BACKUP_RST</name>
                  <description>Return from Backup Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_RST</name>
                  <description>Watchdog fault occurred</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_RST</name>
                  <description>Processor reset required by the software</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_RST</name>
                  <description>NRST pin detected low</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRSTL</name>
              <description>NRST Pin Level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRCMP</name>
              <description>Software Reset Command in Progress</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>URSTEN</name>
              <description>User Reset Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>URSTIEN</name>
              <description>User Reset Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERSTL</name>
              <description>External Reset Length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Write Access Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RSWDT</name>
      <version>11110D</version>
      <description>Reinforced Safety Watchdog Timer</description>
      <groupName>RSWDT</groupName>
      <prependToName>RSWDT_</prependToName>
      <baseAddress>0x400E1900</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RSWDT</name>
        <value>63</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WDRSTT</name>
              <description>Watchdog Restart</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xC4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDV</name>
              <description>Watchdog Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WDFIEN</name>
              <description>Watchdog Fault Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDRSTEN</name>
              <description>Watchdog Reset Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDDIS</name>
              <description>Watchdog Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALLONES</name>
              <description>Must Always Be Written with 0xFFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WDDBGHLT</name>
              <description>Watchdog Debug Halt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDIDLEHLT</name>
              <description>Watchdog Idle Halt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WDUNF</name>
              <description>Watchdog Underflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
