hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
          <register>
            <name>IMR</name>
            <description>Interrupt Mask Register channel = 0</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>COVFS</name>
                <description>Counter Overflow</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LOVRS</name>
                <description>Load Overrun</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPAS</name>
                <description>RA Compare</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPBS</name>
                <description>RB Compare</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPCS</name>
                <description>RC Compare</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRAS</name>
                <description>RA Loading</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRBS</name>
                <description>RB Loading</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ETRGS</name>
                <description>External Trigger</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>EMR</name>
            <description>Extended Mode Register channel = 0</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>TRIGSRCA</name>
                <description>Trigger Source for Input A</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>TRIGSRCASelect</name>
                  <enumeratedValue>
                    <name>EXTERNAL_TIOAx</name>
                    <description>The trigger/capture input A is driven by external pin TIOAx</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMx</name>
                    <description>The trigger/capture input A is driven internally by PWMx</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRIGSRCB</name>
                <description>Trigger Source for Input B</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>TRIGSRCBSelect</name>
                  <enumeratedValue>
                    <name>EXTERNAL_TIOBx</name>
                    <description>The trigger/capture input B is driven by external pin TIOBx</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMx</name>
                    <description>For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output see Figure 7-16 of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC GMAC.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NODIVCLK</name>
                <description>No Divided Clock</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>BCR</name>
          <description>Block Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYNC</name>
              <description>Synchro Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BMR</name>
          <description>Block Mode Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TC0XC0S</name>
              <description>External Clock Signal 0 Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TC0XC0SSelect</name>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>Signal connected to XC0: TCLK0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Signal connected to XC0: TIOA1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Signal connected to XC0: TIOA2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC1XC1S</name>
              <description>External Clock Signal 1 Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TC1XC1SSelect</name>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>Signal connected to XC1: TCLK1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Signal connected to XC1: TIOA0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Signal connected to XC1: TIOA2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC2XC2S</name>
              <description>External Clock Signal 2 Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TC2XC2SSelect</name>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>Signal connected to XC2: TCLK2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Signal connected to XC2: TIOA0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Signal connected to XC2: TIOA1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDEN</name>
              <description>Quadrature Decoder Enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSEN</name>
              <description>Position Enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPEEDEN</name>
              <description>Speed Enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QDTRANS</name>
              <description>Quadrature Decoding Transparent</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EDGPHA</name>
              <description>Edge on PHA Count Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVA</name>
              <description>Inverted PHA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVB</name>
              <description>Inverted PHB</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVIDX</name>
              <description>Inverted Index</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap PHA and PHB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDXPHB</name>
              <description>Index Pin is PHB Pin</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MAXFILT</name>
              <description>Maximum Filter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QIER</name>
          <description>QDEC Interrupt Enable Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QIDR</name>
          <description>QDEC Interrupt Disable Register</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QIMR</name>
          <description>QDEC Interrupt Mask Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QISR</name>
          <description>QDEC Interrupt Status Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMR</name>
          <description>Fault Mode Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENCF0</name>
              <description>Enable Compare Fault Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENCF1</name>
              <description>Enable Compare Fault Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>WPKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                  <value>0x54494D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
