hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
        <register>
          <name>US_LINIR</name>
          <description>LIN Identifier Register</description>
          <addressOffset>0x0058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDCHR</name>
              <description>Identifier Character</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINBRR</name>
          <description>LIN Baud Rate Register</description>
          <addressOffset>0x005C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LINCD</name>
              <description>Clock Divider after Synchronization</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LINFP</name>
              <description>Fractional Part after Synchronization</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONMR</name>
          <description>LON Mode Register</description>
          <addressOffset>0x0060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMT</name>
              <description>LON comm_type Parameter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLDET</name>
              <description>LON Collision Detection Feature</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCOL</name>
              <description>Terminate Frame upon Collision Notification</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDTAIL</name>
              <description>LON Collision Detection on Frame Tail</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAM</name>
              <description>LON DMA Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCDS</name>
              <description>LON Collision Detection Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOFS</name>
              <description>End of Frame Condition Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONPR</name>
          <description>LON Preamble Register</description>
          <addressOffset>0x0064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LONPL</name>
              <description>LON Preamble Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONDL</name>
          <description>LON Data Length Register</description>
          <addressOffset>0x0068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LONDL</name>
              <description>LON Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONL2HDR</name>
          <description>LON L2HDR Register</description>
          <addressOffset>0x006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLI</name>
              <description>LON Backlog Increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ALTP</name>
              <description>LON Alternate Path Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB</name>
              <description>LON Priority Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONBL</name>
          <description>LON Backlog Register</description>
          <addressOffset>0x0070</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LONBL</name>
              <description>LON Node Backlog Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONB1TX</name>
          <description>LON Beta1 Tx Register</description>
          <addressOffset>0x0074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BETA1TX</name>
              <description>LON Beta1 Length after Transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONB1RX</name>
          <description>LON Beta1 Rx Register</description>
          <addressOffset>0x0078</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BETA1RX</name>
              <description>LON Beta1 Length after Reception</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONPRIO</name>
          <description>LON Priority Register</description>
          <addressOffset>0x007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSNB</name>
              <description>LON Priority Slot Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>NPS</name>
              <description>LON Node Priority Slot</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_IDTTX</name>
          <description>LON IDT Tx Register</description>
          <addressOffset>0x0080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDTTX</name>
              <description>LON Indeterminate Time after Transmission comm_type = 1 mode only</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_IDTRX</name>
          <description>LON IDT Rx Register</description>
          <addressOffset>0x0084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDTRX</name>
              <description>LON Indeterminate Time after Reception comm_type = 1 mode only</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_ICDIFF</name>
          <description>IC DIFF Register</description>
          <addressOffset>0x0088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ICDIFF</name>
              <description>IC Differentiator Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0x00E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>WPKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                  <value>0x555341</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>US_WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0x00E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
