hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UTMI</name>
      <version>11300A</version>
      <description>USB Transmitter Interface Macrocell</description>
      <groupName>UTMI</groupName>
      <prependToName>UTMI_</prependToName>
      <baseAddress>0x400E0400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OHCIICR</name>
          <description>OHCI Interrupt Configuration Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RES0</name>
              <description>USB PORTx Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARIE</name>
              <description>OHCI Asynchronous Resume Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APPSTART</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDPPUDIS</name>
              <description>USB Device Pull-up Disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKTRIM</name>
          <description>UTMI Clock Trimming Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FREQ</name>
              <description>UTMI Reference Clock Frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FREQSelect</name>
                <enumeratedValue>
                  <name>XTAL12</name>
                  <description>12 MHz reference clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL16</name>
                  <description>16 MHz reference clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <version>6080J</version>
      <description>Watchdog Timer</description>
      <groupName>WDT</groupName>
      <prependToName>WDT_</prependToName>
      <baseAddress>0x400E1850</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT</name>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WDRSTT</name>
              <description>Watchdog Restart</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDV</name>
              <description>Watchdog Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WDFIEN</name>
              <description>Watchdog Fault Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDRSTEN</name>
              <description>Watchdog Reset Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDDIS</name>
              <description>Watchdog Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDD</name>
              <description>Watchdog Delta Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WDDBGHLT</name>
              <description>Watchdog Debug Halt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDIDLEHLT</name>
              <description>Watchdog Idle Halt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WDUNF</name>
              <description>Watchdog Underflow cleared on read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDERR</name>
              <description>Watchdog Error cleared on read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
