hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
          <register>
            <name>CIS</name>
            <description>Channel Interrupt Status Register chid = 0</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>BIS</name>
                <description>End of Block Interrupt Status Bit</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LIS</name>
                <description>End of Linked List Interrupt Status Bit</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DIS</name>
                <description>End of Disable Interrupt Status Bit</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>FIS</name>
                <description>End of Flush Interrupt Status Bit</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>RBEIS</name>
                <description>Read Bus Error Interrupt Status Bit</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>WBEIS</name>
                <description>Write Bus Error Interrupt Status Bit</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ROIS</name>
                <description>Request Overflow Error Interrupt Status Bit</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CSA</name>
            <description>Channel Source Address Register chid = 0</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>SA</name>
                <description>Channel x Source Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CDA</name>
            <description>Channel Destination Address Register chid = 0</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>DA</name>
                <description>Channel x Destination Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNDA</name>
            <description>Channel Next Descriptor Address Register chid = 0</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>NDAIF</name>
                <description>Channel x Next Descriptor Interface</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>NDA</name>
                <description>Channel x Next Descriptor Address</description>
                <bitOffset>2</bitOffset>
                <bitWidth>30</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNDC</name>
            <description>Channel Next Descriptor Control Register chid = 0</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>NDE</name>
                <description>Channel x Next Descriptor Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>NDESelect</name>
                  <enumeratedValue>
                    <name>DSCR_FETCH_DIS</name>
                    <description>Descriptor fetch is disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DSCR_FETCH_EN</name>
                    <description>Descriptor fetch is enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NDSUP</name>
                <description>Channel x Next Descriptor Source Update</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>NDSUPSelect</name>
                  <enumeratedValue>
                    <name>SRC_PARAMS_UNCHANGED</name>
                    <description>Source parameters remain unchanged.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SRC_PARAMS_UPDATED</name>
                    <description>Source parameters are updated when the descriptor is retrieved.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NDDUP</name>
                <description>Channel x Next Descriptor Destination Update</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>NDDUPSelect</name>
                  <enumeratedValue>
                    <name>DST_PARAMS_UNCHANGED</name>
                    <description>Destination parameters remain unchanged.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DST_PARAMS_UPDATED</name>
                    <description>Destination parameters are updated when the descriptor is retrieved.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NDVIEW</name>
                <description>Channel x Next Descriptor View</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>NDVIEWSelect</name>
                  <enumeratedValue>
                    <name>NDV0</name>
                    <description>Next Descriptor View 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NDV1</name>
                    <description>Next Descriptor View 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NDV2</name>
                    <description>Next Descriptor View 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NDV3</name>
                    <description>Next Descriptor View 3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CUBC</name>
            <description>Channel Microblock Control Register chid = 0</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>UBLEN</name>
                <description>Channel x Microblock Length</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CBC</name>
            <description>Channel Block Control Register chid = 0</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>BLEN</name>
                <description>Channel x Block Length</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CC</name>
            <description>Channel Configuration Register chid = 0</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>TYPE</name>
                <description>Channel x Transfer Type</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>TYPESelect</name>
                  <enumeratedValue>
                    <name>MEM_TRAN</name>
                    <description>Self triggered mode Memory to Memory Transfer.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PER_TRAN</name>
                    <description>Synchronized mode Peripheral to Memory or Memory to Peripheral Transfer.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MBSIZE</name>
                <description>Channel x Memory Burst Size</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>MBSIZESelect</name>
                  <enumeratedValue>
                    <name>SINGLE</name>
                    <description>The memory burst size is set to one.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FOUR</name>
                    <description>The memory burst size is set to four.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EIGHT</name>
                    <description>The memory burst size is set to eight.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEEN</name>
                    <description>The memory burst size is set to sixteen.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DSYNC</name>
                <description>Channel x Synchronization</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>DSYNCSelect</name>
                  <enumeratedValue>
                    <name>PER2MEM</name>
                    <description>Peripheral to Memory transfer.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MEM2PER</name>
                    <description>Memory to Peripheral transfer.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWREQ</name>
                <description>Channel x Software Request Trigger</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>SWREQSelect</name>
                  <enumeratedValue>
                    <name>HWR_CONNECTED</name>
                    <description>Hardware request line is connected to the peripheral request line.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SWR_CONNECTED</name>
                    <description>Software request is connected to the peripheral request line.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEMSET</name>
                <description>Channel x Fill Block of memory</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>MEMSETSelect</name>
                  <enumeratedValue>
                    <name>NORMAL_MODE</name>
                    <description>Memset is not activated.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HW_MODE</name>
                    <description>Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSIZE</name>
                <description>Channel x Chunk Size</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <name>CSIZESelect</name>
                  <enumeratedValue>
                    <name>CHK_1</name>
                    <description>1 data transferred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHK_2</name>
                    <description>2 data transferred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHK_4</name>
                    <description>4 data transferred</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHK_8</name>
                    <description>8 data transferred</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHK_16</name>
                    <description>16 data transferred</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DWIDTH</name>
                <description>Channel x Data Width</description>
                <bitOffset>11</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>DWIDTHSelect</name>
                  <enumeratedValue>
                    <name>BYTE</name>
                    <description>The data size is set to 8 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HALFWORD</name>
                    <description>The data size is set to 16 bits</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WORD</name>
                    <description>The data size is set to 32 bits</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIF</name>
                <description>Channel x Source Interface Identifier</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>SIFSelect</name>
                  <enumeratedValue>
                    <name>AHB_IF0</name>
                    <description>The data is read through the system bus interface 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AHB_IF1</name>
                    <description>The data is read through the system bus interface 1.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIF</name>
                <description>Channel x Destination Interface Identifier</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>DIFSelect</name>
                  <enumeratedValue>
                    <name>AHB_IF0</name>
                    <description>The data is written through the system bus interface 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AHB_IF1</name>
                    <description>The data is written though the system bus interface 1.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAM</name>
                <description>Channel x Source Addressing Mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>SAMSelect</name>
                  <enumeratedValue>
                    <name>FIXED_AM</name>
                    <description>The address remains unchanged.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INCREMENTED_AM</name>
                    <description>The addressing mode is incremented the increment size is set to the data size.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UBS_AM</name>
                    <description>The microblock stride is added at the microblock boundary.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UBS_DS_AM</name>
                    <description>The microblock stride is added at the microblock boundary, the data stride is added at the data boundary.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DAM</name>
                <description>Channel x Destination Addressing Mode</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>DAMSelect</name>
                  <enumeratedValue>
                    <name>FIXED_AM</name>
                    <description>The address remains unchanged.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INCREMENTED_AM</name>
                    <description>The addressing mode is incremented the increment size is set to the data size.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UBS_AM</name>
                    <description>The microblock stride is added at the microblock boundary.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UBS_DS_AM</name>
                    <description>The microblock stride is added at the microblock boundary, the data stride is added at the data boundary.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INITD</name>
                <description>Channel Initialization Terminated this bit is read-only</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>INITDSelect</name>
                  <enumeratedValue>
                    <name>IN_PROGRESS</name>
                    <description>Channel initialization is in progress.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TERMINATED</name>
                    <description>Channel initialization is completed.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RDIP</name>
                <description>Read in Progress this bit is read-only</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>RDIPSelect</name>
                  <enumeratedValue>
                    <name>DONE</name>
                    <description>No Active read transaction on the bus.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IN_PROGRESS</name>
                    <description>A read transaction is in progress.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRIP</name>
                <description>Write in Progress this bit is read-only</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>WRIPSelect</name>
                  <enumeratedValue>
                    <name>DONE</name>
                    <description>No Active write transaction on the bus.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IN_PROGRESS</name>
                    <description>A Write transaction is in progress.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERID</name>
                <description>Channel x Peripheral Hardware Request Line Identifier</description>
                <bitOffset>24</bitOffset>
                <bitWidth>7</bitWidth>
              </field>
            </fields>
          </register>
