hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FPU</name>
      <description>Floating Point Unit</description>
      <groupName>FPU</groupName>
      <prependToName>FPU_</prependToName>
      <baseAddress>0xE000EF30</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FPU</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>IXC</name>
        <value>68</value>
      </interrupt>
      <registers>
        <register>
          <name>FPCCR</name>
          <description>Floating-point Context Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>LSPACT</name>
              <description>Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USER</name>
              <description>Privilege level was user when the floating-point stack frame was allocated.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREAD</name>
              <description>Mode was Thread Mode when the floating-point stack frame was allocated.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HFRDY</name>
              <description>Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMRDY</name>
              <description>MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BFRDY</name>
              <description>BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MONRDY</name>
              <description>DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSPEN</name>
              <description>Enable automatic lazy state preservation for floating-point context.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASPEN</name>
              <description>Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCAR</name>
          <description>Floating-point Context Address Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>The location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FPDSCR</name>
          <description>Floating-point Default Status Control Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMode</name>
              <description>Default value for FPSCR.RMode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FZ</name>
              <description>Default value for FPSCR.FZ.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DN</name>
              <description>Default value for FPSCR.DN.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHP</name>
              <description>Default value for FPSCR.AHP.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR0</name>
          <description>Media and VFP Feature Register 0</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10110021</resetValue>
          <fields>
            <field>
              <name>A_SIMD_registers</name>
              <description>Indicates the size of the FP register bank</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Single_precision</name>
              <description>Indicates the hardware support for FP single-precision operations</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Double_precision</name>
              <description>Indicates the hardware support for FP double-precision operations</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FP_excep_trapping</name>
              <description>Indicates whether the FP hardware implementation supports exception trapping</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Divide</name>
              <description>Indicates the hardware support for FP divide operations</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Square_root</name>
              <description>Indicates the hardware support for FP square root operations</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Short_vectors</name>
              <description>Indicates the hardware support for FP short vectors</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FP_rounding_modes</name>
              <description>Indicates the rounding modes supported by the FP floating-point hardware</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR1</name>
          <description>Media and VFP Feature Register 1</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x11000011</resetValue>
          <fields>
            <field>
              <name>FtZ_mode</name>
              <description>Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>D_NaN_mode</name>
              <description>Indicates whether the FP hardware implementation supports only the Default NaN mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FP_HPFP</name>
              <description>Floating Point Half-Precision and double-precision</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FP_fused_MAC</name>
              <description>Indicates whether the FP supports fused multiply accumulate operations</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR2</name>
          <description>Media and VFP Feature Register 2</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>VFP_Misc</name>
              <description>Indicates the hardware support for FP miscellaneous features</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
